Revit 2027 API
BuiltInFailures.RebarShapeFailures.DefaultParamaterValuesIncorrect Property
 Default parameters have incorrect values. One reason for failure might be an edge length that is too short (it's smaller than bent radius).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DefaultParamaterValuesIncorrect { get; }
Public Shared ReadOnly Property DefaultParamaterValuesIncorrect As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DefaultParamaterValuesIncorrect {
	FailureDefinitionId^ get ();
}
static member DefaultParamaterValuesIncorrect : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace